argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
/* Private function prototypes -----------------------------------------------*/
extern "C" void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_CRC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_USART1_UART_Init(void);
extern void GRAPHICS_HW_Init(void);
extern void GRAPHICS_Init(void);
extern void GRAPHICS_MainTask(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_RNG_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);
void StartButtonTask(void const * argument);
void StartLEDTask(void const * argument);
void StartSDTask(void const * argument);
void StartLWIPTask(void const * argument);
void StartDHCPTask(void const * argument);

/* USER CODE BEGIN PFP */
void Start_HTTP_Client_Task(void const * argument);
void Start_HTTP_Server_Task(void const * argument);
void Start_SD_Logger_Task(void const * argument);

uint16_t cli_printf(const char* fmt, ...);
uint16_t cli_write(const char* src, uint16_t len);

void debug_print(uint8_t dbg_mask, char* label, const char* fnc, char* msg, int8_t* val, char* txt);

static int jsoneq(const char *json, jsmntok_t *tok, const char *s);

err_t post_thingspeak(void);

FRESULT sd_scan_files(char* path);
FRESULT sd_get_free_clusters(FATFS* fs);
FRESULT sd_append(char* fn, char* wtext);
FRESULT sd_log(uint8_t data);
FRESULT sd_dump(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern struct netif gnetif;
extern ip4_addr_t ipaddr;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_CRC_Init();
  MX_I2C1_Init();
  MX_I2C3_Init();
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_USART1_UART_Init();
  MX_SDMMC1_SD_Init();
  MX_RNG_Init();
  MX_USART6_UART_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

/* Initialise the graphical hardware */
  GRAPHICS_HW_Init();

  /* Initialise the graphical stack engine */
  GRAPHICS_Init();
      
  

  /* USER CODE BEGIN RTOS_MUTEX */
    /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* definition and creation of dhcpBinarySem */
  osSemaphoreDef(dhcpBinarySem);
  dhcpBinarySemHandle = osSemaphoreCreate(osSemaphore(dhcpBinarySem), 1);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
    /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
    /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 4);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of buttonTask */
  osThreadDef(buttonTask, StartButtonTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  buttonTaskHandle = osThreadCreate(osThread(buttonTask), NULL);

  /* definition and creation of ledTask */
  osThreadDef(ledTask, StartLEDTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  ledTaskHandle = osThreadCreate(osThread(ledTask), NULL);

  /* definition and creation of sdTask */
  osThreadDef(sdTask, StartSDTask, osPriorityAboveNormal, 0, configMINIMAL_STACK_SIZE * 4);
  sdTaskHandle = osThreadCreate(osThread(sdTask), NULL);

  /* definition and creation of lwipTask */
  osThreadDef(lwipTask, StartLWIPTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  lwipTaskHandle = osThreadCreate(osThread(lwipTask), (void*)&gnetif);

  /* definition and creation of dhcpTask */
  osThreadDef(dhcpTask, StartDHCPTask, osPriorityAboveNormal, 0, configMINIMAL_STACK_SIZE * 4);
  dhcpTaskHandle = osThreadCreate(osThread(dhcpTask), (void*)&gnetif);

  /* USER CODE BEGIN RTOS_THREADS */
    /* add threads, ... */

  /* definition and creation of httpClientTask */
  osThreadDef(httpClientTask, Start_HTTP_Client_Task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  httpClientTaskHandle = osThreadCreate(osThread(httpClientTask), (void*)&gnetif);
  
  /* definition and creation of httpServerTask */
  osThreadDef(httpServerTask, Start_HTTP_Server_Task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 6);
  httpServerTaskHandle = osThreadCreate(osThread(httpServerTask), (void*)&gnetif);

    /* definition and creation of SDLoggerTask */
  osThreadDef(SDLoggerTask, Start_SD_Logger_Task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 8);
  SDLoggerTaskHandle = osThreadCreate(osThread(SDLoggerTask), NULL);

  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of buttonQueue */
  osMessageQDef(buttonQueue, 4, uint8_t);
  buttonQueueHandle = osMessageCreate(osMessageQ(buttonQueue), NULL);

  /* definition and creation of ledQueue */
  osMessageQDef(ledQueue, 4, uint8_t);
  ledQueueHandle = osMessageCreate(osMessageQ(ledQueue), NULL);

  /* definition and creation of tcpQueue */
  osMessageQDef(tcpQueue, 8, uint16_t);
  tcpQueueHandle = osMessageCreate(osMessageQ(tcpQueue), NULL);

  /* definition and creation of logQueue */
  osMessageQDef(logQueue, 8, uint16_t);
  logQueueHandle = osMessageCreate(osMessageQ(logQueue), NULL);

  /* definition and creation of dumpQueue */
  osMessageQDef(dumpQueue, 1, uint16_t);
  dumpQueueHandle = osMessageCreate(osMessageQ(dumpQueue), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
    /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

