argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*Configure GPIO pins : ARDUINO_A4_Pin ARDUINO_A5_Pin ARDUINO_A1_Pin ARDUINO_A2_Pin 
                           ARDUINO_A3_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A4_Pin|ARDUINO_A5_Pin|ARDUINO_A1_Pin|ARDUINO_A2_Pin 
                          |ARDUINO_A3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_A0_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ARDUINO_A0_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DCMI_HSYNC_Pin PA6 */
  GPIO_InitStruct.Pin = DCMI_HSYNC_Pin|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF13_DCMI;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_PWM_D6_Pin */
  GPIO_InitStruct.Pin = ARDUINO_PWM_D6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_TIM12;
  HAL_GPIO_Init(ARDUINO_PWM_D6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void debug_print(uint8_t dbg_mask, char* label, const char* fnc, char* msg, int8_t* val, char* txt)
{
  if (0 < (dbg_mask & bg_enabled)) {
    if (NULL != msg) {
      if ((NULL != val) && (NULL != txt)) {
        cli_printf("[%s] %s --> %s: %s (val = %d)\r\n", label, fnc, msg, txt, *val);
      } else if (NULL != val) {
        cli_printf("[%s] %s --> %s (val = %d)\r\n", label, fnc, msg, *val);
      } else if (NULL != txt) {
        cli_printf("[%s] %s --> %s: %s\r\n", label, fnc, msg, txt);
      } else {
        cli_printf("[%s] %s --> %s\r\n", label, fnc, msg);
      }
    }
  }
}

uint16_t cli_printf(const char* fmt, ...)
{
  uint16_t len = 0;
  va_list args;
  va_start(args, fmt);
  vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  // tfp_vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  len = cli_write(&cli_buff[0], strlen(cli_buff));
  va_end(args);    

  return len;
}

void jsmn_parser_example(char* json_string, uint16_t len)
{
  int i;
  int r;
  jsmn_parser p;
  jsmntok_t t[128]; /* We expect no more than 128 tokens */

  jsmn_init(&p);
  r = jsmn_parse(&p, json_string, len, t, sizeof(t)/sizeof(t[0]));
  if (r < 0) 
  {
    DBG_JSMN("Failed to parse JSON", &r, NULL)
    //return 1;
  }

  /* Assume the top-level element is an object */
  if (r < 1 || t[0].type != JSMN_OBJECT) {
    DBG_JSMN("Object expected", &r, NULL)
    // return 1;
  }

  /* Loop over all keys of the root object */
  for (i = 1; i < r; i++) {
          if (jsoneq(json_string, &t[i], "channel_id") == 0) {
                  /* We may use strndup() to fetch string value */
                  cli_printf("[JSMN] Channel ID: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
          } else if (jsoneq(json_string, &t[i], "entry_id") == 0) {
                  /* We may additionally check if the value is either "true" or "false" */
                  cli_printf("[JSMN] Entry ID: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
          } else if (jsoneq(json_string, &t[i], "field1") == 0) {
                  /* We may want to do strtol() here to get numeric value */
                  cli_printf("[JSMN] Field1: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
#if 0
          } else if (jsoneq(json_string, &t[i], "groups") == 0) {
                  int j;
                  cli_printf("- Groups:\r\n");
                  if (t[i+1].type != JSMN_ARRAY) {
                          continue; /* We expect groups to be an array of strings */
                  }
                  for (j = 0; j < t[i+1].size; j++) {
                          jsmntok_t *g = &t[i+j+2];
                          cli_printf("  * %.*s\r\n", g->end - g->start, json_string + g->start);
                  }
                  i += t[i+1].size + 1;
#endif
          } else {
                  // cli_printf("Unexpected key: %.*s\r\n", t[i].end-t[i].start, json_string + t[i].start);
          }
  }
}


uint16_t cli_write(const char* src, uint16_t len)
{
  if ((src != NULL) && (len > 0))
  {
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
    // HAL_UART_Transmit(&huart6, (uint8_t*)src, len, 100);
  }
  return len;
}

FRESULT sd_get_free_clusters(FATFS* fs)
{
    FRESULT fr;
    DWORD fre_clust, fre_sect, tot_sect;

    /* Get volume information and free clusters of used drive */
    fr = f_getfree((TCHAR const*)SDPath, &fre_clust, &fs);
    if (fr == FR_OK)
    {
      /* Get total sectors and free sectors */
      tot_sect = (fs->n_fatent - 2) * fs->csize * _MAX_SS;
      fre_sect = fre_clust * fs->csize * _MAX_SS;

      /* Print the free space (assuming 512 bytes/sector) */
      cli_printf("[FatFs] Number of Free Clusters:\r\n");
      cli_printf("\t%8lu KB Used\r\n", (tot_sect - fre_sect)/1024);
      cli_printf("\t%8lu KB Available\r\n", fre_sect/1024);
      cli_printf("\t%8lu KB Total\r\n", tot_sect/1024);
    }
    else
    {
      DBG_FATFS("f_getfree",  &fr, NULL);
    }
    
