argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
    return fr;
}

FRESULT read_file_sector(FIL* file, void* dest, FSIZE_t len, UINT* bytesread, UINT index)
{
  FRESULT fr;

  fr = f_open(file, "index.htm", FA_READ);
  if(fr != FR_OK)
  {
    DBG_FATFS("f_open",  &fr, NULL);
  }
  else
  {
    fr = f_lseek(file, (index * len));
    if(fr != FR_OK)
    {
      DBG_FATFS("f_lseek",  &fr, NULL);
    }
    else
    {
      fr = f_read(file, dest, len, bytesread);
      if(fr != FR_OK)
      {
        DBG_FATFS("f_read",  &fr, NULL);
      }
    }
    
    fr = f_close(file);
    if(fr != FR_OK)
    {
      DBG_FATFS("f_close",  &fr, NULL);
    }
  }
  
  return fr;
}

/* Start node to be scanned (***also used as work area***) */
FRESULT sd_scan_files(char* path)
{
    FRESULT fr;
    DIR dir;
    UINT i;
    static FILINFO fno;

    fr = f_opendir(&dir, path);                       /* Open the directory */
    if (fr == FR_OK) {
        for (;;) {
            fr = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (fr != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    
                /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "\t%s (%4d bytes)", fno.fname, fno.fsize);
                fr = sd_scan_files(path);                    /* Enter the directory */
                if (fr != FR_OK) break;
                path[i] = 0;
            }
            else 
            {                                       
                /* It is a file. */
                cli_printf("\t%s  (%4d bytes)\r\n", fno.fname, fno.fsize);
            }
        }
        f_closedir(&dir);
    }

    return fr;
}

static int jsoneq(const char *json, jsmntok_t *tok, const char *s) {
	if (tok->type == JSMN_STRING && (int) strlen(s) == tok->end - tok->start &&
			strncmp(json + tok->start, s, tok->end - tok->start) == 0) {
		return 0;
	}
	return -1;
}

err_t post_thingspeak(lwhttp_request_t* req_ptr, lwhttp_response_t* rsp_ptr, uint8_t data)
{
  /* LwIP PV */
  // struct netif* netif = (struct netif*)argument;
  struct netconn *conn;
  struct netbuf *netbuf = NULL;
  ip4_addr_t remote_ip; 
  err_t err;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  
  /* JSON PV */
  const char* json_data_fmt = "{\"api_key\": \"%s\", \"delta_t\": %d, \"field1\": %d}";
  uint8_t json_data[128];
  uint8_t json_data_len[4];
  
  /* Thingspeak server PV */
  const char* key = "WTN6FH385TCUNDMU";
  const char* server = "api.thingspeak.com";
  const char* url = "/update.json?headers=false";

  DBG_LWIP("Send TCP",  &data, NULL);

  if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
  {
    /* Parse HTTP Body in JSON format */
    sprintf((char *)json_data, json_data_fmt, key, 5, data);  
    sprintf((char *)json_data_len, "%d", strlen((char *)json_data));  
          
    /* Build HTTP Request */
    lwhttp_request_put_request_line(req_ptr, LwHHTP_POST, url);
    lwhttp_request_put_message_header(req_ptr, "Content-Type", "application/json");
    lwhttp_request_put_message_header(req_ptr, "Content-Length", (char *)json_data_len);
    lwhttp_request_put_message_body(req_ptr, (char*)json_data, strlen((char *)json_data));  
          
    /* Run LwHTTP Request Parser */
    lwhttp_request_parse(req_ptr);
          
    /* LwIP Connect TCP */
    conn = netconn_new(NETCONN_TCP);        
    if (NULL != conn)
    {
#if 0
      /* Bind a netconn to a specific local IP address and port (optional) */
      err = netconn_bind(conn, &netif->ip_addr, 60);
      if (err != ERR_OK)
      {
        cli_printf("[LwIP] %s --> netconn_bind (ERR = %d)\r\n", err);
      }
      else
#endif
      {
        err  = netconn_gethostbyname(server, &remote_ip);
        if (ERR_OK == err)
        {
          DBG_LWIP(server,  NULL, ip4addr_ntoa((const ip4_addr_t *)&remote_ip));
          
          /* Connect to server */
          err = netconn_connect(conn, &remote_ip, 80); 
          if (ERR_OK == err)
          {
            DBG_LWIP("Connection",  NULL, "OK!");

            /* Get LwHTTP Request Data */
            lwhttp_request_get(req_ptr, &temp_buf_data, &temp_buf_data_len);

#if 0
            cli_printf("[LwIP] %s --> Request:\r\n", __FUNCTION__); 
            cli_write(req_ptr->buffer.data, req_ptr->buffer.len);
            cli_printf("\r\n");
#endif     

            /* Write data to server */
            err = netconn_write(conn, temp_buf_data, temp_buf_data_len, NETCONN_NOFLAG);
            if (ERR_OK == err)
            {
              DBG_LWIP("netconn_write",  &temp_buf_data_len, NULL);

              /* Get pointer to buffer where response data is stored */
              while (( err = netconn_recv(conn, &netbuf)) == ERR_OK)
              {
                  do
                  {
                    /* Get pointer to data and length*/
                    netbuf_data(netbuf, (void**)&temp_buf_data, &temp_buf_data_len);
                    
                    /* LwHTTP write response to parser */
                    lwhttp_response_put(rsp_ptr, (char*)temp_buf_data, temp_buf_data_len);
                  }
                  while (netbuf_next(netbuf) >= 0);

                  /* Free data buffer */
                  netbuf_delete(netbuf);
              }
              
              if ((ERR_OK == err) || (err == ERR_CLSD))
              {
                /* Run LwHTTP Request Parser */
                lwhttp_response_parse(rsp_ptr);

                DBG_LWIP("netconn_recv",  &rsp_ptr->buffer.len, NULL);

                if (rsp_ptr->start_line.status_line.status_code.data != NULL)
                {
                  /* Print HTTP Request */
                  lwhttp_request_get_request_line(req_ptr, &temp_buf_data, &temp_buf_data_len);
                  cli_printf("[LwHTTP] Request-Line: %.*s\r\n", temp_buf_data_len, temp_buf_data);

                  /* Parse & Print LwHTTP Response */
                  lwhttp_response_parse(rsp_ptr);
                  lwhttp_response_get_status_line(rsp_ptr, &temp_buf_data, &temp_buf_data_len);
                  cli_printf("[LwHTTP] Status-Line: %.*s\r\n\r\n", temp_buf_data_len, temp_buf_data);
                  
                  err = ERR_OK;               
                }
                else
                {
                  err = ERR_MEM;
                }
              }
              else
              {
                DBG_LWIP("netconn_recv", &err, NULL);
              }
            }
            else
            {
              DBG_LWIP("netconn_write", &err, NULL);
            }
          }
          else
          {
            DBG_LWIP("netconn_connect", &err, NULL);
          }
        }
        else
        {
          DBG_LWIP("netconn_gethostbyname", &err, NULL);
        }
      }
      
      netconn_delete(conn);
    }
    else
    {
      err = ERR_CONN;
      DBG_LWIP("netconn_new",  &err, NULL);
    }    
  }
  else
  {
    DBG_DHCP("Unable to send TCP", &DHCP_state, "DHCP State");
  }

