argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
          /* Close & Delete connection */
          netconn_close(newconn);
          netconn_delete(newconn);
        
          /* Print HTTP Request */
          lwhttp_request_get_request_line(&server_request, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Request-Line: %.*s\r\n", temp_buf_data_len, temp_buf_data);
          
          /* Print HTTP Response */
          lwhttp_response_parse(&server_response);
          lwhttp_response_get_status_line(&server_response, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Status-Line: %.*s\r\n\r\n", temp_buf_data_len, temp_buf_data);
            
          /* Free LwHTTP Request & Response */
          lwhttp_request_free(&server_request);
          lwhttp_response_free(&server_response);
        }
        
        osDelay(10);
      }
    }
  }

  /* USER CODE END Start_HTTP_Server_Task */
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{

  /* Graphic application */  
  GRAPHICS_MainTask();
      
  /* USER CODE BEGIN 5 */
  DBG_RTOS("Start Task",  NULL, NULL);

  /* Infinite loop */
  for (;;)
  {
      osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartButtonTask */
/**
* @brief Function implementing the buttonTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartButtonTask */
void StartButtonTask(void const * argument)
{
  /* USER CODE BEGIN StartButtonTask */
  uint32_t buttonState = 0;
  uint8_t buttonCount = 0;
  
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
  
  DBG_RTOS("Start Task",  NULL, NULL);

  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      if(xQueueSend(buttonQueueHandle, (uint8_t*)&buttonState, 0) == pdTRUE)
      {
        buttonCount++;
        DBG_QUEUE("buttonQueueHandle",  &buttonCount, NULL);
      }
    }
    
    osDelay(100);
  }
  /* USER CODE END StartButtonTask */
}

/* USER CODE BEGIN Header_StartLEDTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLEDTask */
void StartLEDTask(void const * argument)
{
  /* USER CODE BEGIN StartLEDTask */
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);
  
  DBG_RTOS("Start Task",  NULL, NULL);
      
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      DBG_QUEUE("ledQueueHandle", &led_state, NULL);
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
    }
    
    osDelay(20);
  }
  /* USER CODE END StartLEDTask */
}

FRESULT sd_append(char* fn, char* wtext)
{
  FRESULT fr;                                    /* FatFs function common result code */
  FIL fil;                                       /* File object */

  uint32_t byteswritten = 0;                     /* File write/read counts */

  DBG_FATFS("File name",  NULL, fn);
  DBG_FATFS("Text",  NULL, wtext);

  /*##-3- Create and Open a new text file object with write access #####*/
  fr = f_open(&fil, (char*)fn, FA_OPEN_ALWAYS | FA_WRITE);
  if(fr == FR_OK)
  {    
    /*##-4- Prepare to append data to the text file ################################*/
    fr = f_lseek(&fil, f_size(&fil));
    if(fr == FR_OK)
    {
      /*##-5- Write data to the text file ################################*/
      fr = f_write(&fil, wtext, strlen(wtext), (UINT *)&byteswritten);
      if(fr == FR_OK)
      {
        DBG_FATFS("byteswritten",  &byteswritten, NULL);
      }
      else
      {
        DBG_FATFS("f_write", &fr, NULL);
      }
    }
    else
    {
      DBG_FATFS("f_lseek", &fr, NULL);
    }
    
    /*##-6- Close the open text file #################################*/
    fr = f_close(&fil);
    if(fr != FR_OK)
    {
      DBG_FATFS("f_close", &fr, NULL);
    }
  }
  else
  {
    DBG_FATFS("f_open", &fr, NULL);
  }
  
  return fr;
}

FRESULT sd_log(uint8_t data)
{
  uint8_t buffer[32];
  snprintf((char*)buffer, sizeof(buffer), "Log entry = %u\r\n", data);
  return sd_append((char*)sd_log_filename, (char*)buffer);
}

FRESULT sd_dump(void)
{
  FRESULT fr;                                 /* FatFs function common result code */
  FIL fil;                                    /* File object */
  uint32_t bytesread = 0;                     /* File write/read counts */
  uint8_t rtext[256];                         /* File read buffer */

  DBG_FATFS("File name",  NULL, (char*)sd_log_filename);

  /*##-7- Open the text file object with read access ###############*/
  fr = f_open(&fil, (char*)sd_log_filename, FA_READ);
  if(fr == FR_OK)
  {
    do
    {
      /*##-8- Read data from the text file ###########################*/
      fr = f_read(&fil, rtext, sizeof(rtext), (UINT*)&bytesread);
      if(fr == FR_OK)
      {
        if(bytesread > 0)
        {
          cli_write((char*)&rtext[0], bytesread);
        }
      }
      else 
      {
        DBG_FATFS("f_read", &fr, NULL);
      }
    } while((bytesread > 0) && (fr == FR_OK));

    /*##-6- Close the open text file #################################*/
    fr = f_close(&fil);
    if(fr != FR_OK)
    {
      DBG_FATFS("f_close", &fr, NULL);
    }
  }
  else
  {
    DBG_FATFS("f_open", &fr, NULL);
  }
  
  return fr;
}

/* USER CODE BEGIN Header_StartSDTask */
/**
* @brief Function implementing the sdTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{
  /* USER CODE BEGIN StartSDTask */
  FRESULT fr;                                 /* FatFs function common result code */
  FATFS* fs = &SDFatFs;                       /* File system object for SD card logical drive */
  uint8_t ret = 0;
  uint32_t rng_value = 0;
  uint8_t file_name[16];

  /* init code for FATFS */
  MX_FATFS_Init();

  DBG_RTOS("Start Task",  NULL, NULL);

  /*##-1- Link the micro SD disk I/O driver ##################################*/
  ret = BSP_SD_Init();
  if(ret == MSD_OK)
  {
    /*##-2- Register the file system object to the FatFs module ##############*/
    fr = f_mount(fs, (TCHAR const*)SDPath, 0);
    if(fr == FR_OK)
    {
      DBG_FATFS("f_mount", NULL, "OK!");
    }
    else
    {
      DBG_FATFS("f_mount", &fr, NULL);
    }
  }
  else
  {
    DBG_FATFS("BSP_SD_Init", &ret, NULL);
  }

  /* Get random number */
  HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);

  /* Parse filename */
  snprintf((char*)file_name, 16, "file%u.TXT", (uint8_t)(rng_value % 10));

  /* Add to file */
  sd_append((char*)file_name, (char*)"STM32 FatFs Demo\r\n");
  
