argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }

  FATFS_UnLinkDriver(SDPath);

  /* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_StartLWIPTask */
/**
* @brief Function implementing the lwipTask thread.
* @param argument: Not used
* @retval None
*/

void setDHCP_State(uint8_t state)
{
  DBG_DHCP("DHCP State change", &state, NULL);
  DHCP_state = state;
}

void StartLWIPTask(void const * argument)
{
  /* USER CODE BEGIN StartLWIPTask */
  /* LwIP PV */
  struct netif* netif = (struct netif*)argument;
  
  /* init code for LWIP */
  MX_LWIP_Init();

  DBG_RTOS("Start Task",  NULL, NULL);
  
  /* Check interface status */
  if (netif_is_up(netif))
  {
    setDHCP_State(DHCP_START);
  }
  else
  {  
    setDHCP_State(DHCP_LINK_DOWN);
  }

  /* Infinite loop */
  for(;;)
  {    
    if (netif_is_up(netif) && (DHCP_state == DHCP_OFF))
    {
      setDHCP_State(DHCP_START);
    }
    else
    {
      osDelay(10);
    }
  }
  /* USER CODE END StartLWIPTask */
}

/* USER CODE END Header_StartDHCPTask */
void StartDHCPTask(void const * argument)
{
  /* USER CODE BEGIN StartDHCPTask */
  struct netif* netif = (struct netif*)argument;
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
  struct dhcp *dhcp;
  uint8_t iptxt[20];
  
  /* Get DHCP instance */
  dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

  DBG_RTOS("Start Task",  NULL, NULL);
  
  for (;;)
  {
    switch (DHCP_state)
    {
    case DHCP_START:
      {
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);       
        dhcp_start(netif);
        setDHCP_State(DHCP_WAIT_ADDRESS);
        DBG_DHCP("Looking for server", NULL, NULL);
      }
      break;
      
    case DHCP_WAIT_ADDRESS:
      {                
        if (dhcp_supplied_address(netif)) 
        {
          setDHCP_State(DHCP_ADDRESS_ASSIGNED); 
          DBG_DHCP("Supplied address", NULL, ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
        }
        else
        {
          dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
    
          /* DHCP timeout */
          if (dhcp->tries > MAX_DHCP_TRIES)
          {
            setDHCP_State(DHCP_TIMEOUT);
            
            /* Stop DHCP */
            dhcp_stop(netif);
            
            /* Static address used */
            IP_ADDR4(&ipaddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
            IP_ADDR4(&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
            IP_ADDR4(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
            netif_set_addr(netif, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gw));
            
            DBG_DHCP("Timeout", NULL, NULL);
            DBG_DHCP("Static IP address", NULL, ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
          }
        }
      }
      break;
    case DHCP_LINK_DOWN:
      {
        /* Stop DHCP */
        dhcp_stop(netif);
        setDHCP_State(DHCP_OFF); 
      }
      break;
    default: 
      break;
    }
    
    /* wait 250 ms */
    osDelay(250);
  }
  
#if 0  
  /* Infinite loop */
  for(;;)
  {
    memset(PAGE_BODY, 0,256);
    /* The list of tasks and their status */
    osThreadList((unsigned char *)PAGE_BODY);

    cli_printf("\r\nName          State  Priority  Stack   Num\r\n" );
    cli_printf("---------------------------------------------\r\n");
    cli_write((char*)PAGE_BODY, strlen((char*)PAGE_BODY));
    cli_printf("---------------------------------------------\r\n");
    cli_printf("B : Blocked, R : Ready, D : Deleted, S : Suspended\r\n");
    osDelay(1000);
  }
#endif

  /* USER CODE END StartDHCPTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
